# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [4]:
cur.execute("""SELECT firstName, lastName 
               FROM employees 
               JOIN offices 
               USING (officecode)
               WHERE city = 'Boston';""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [30]:
cur.execute("""

                SELECT officeCode, city, COUNT(employeeNumber) AS number_
                FROM offices 
                LEFT JOIN employees 
                USING (officeCode)
                GROUP BY officeCode
                
            """)
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   officeCode           city  number_
0           1  San Francisco        6
1           2         Boston        2
2           3            NYC        2
3           4          Paris        5
4           5          Tokyo        2
5           6         Sydney        4
6           7         London        2
7          27         Boston        0

In [29]:
cur.execute("""SELECT officeCode, city, COUNT(employeeNumber) AS number_
               FROM offices 
               LEFT JOIN employees 
               USING (officeCode)
               GROUP BY officeCode
               HAVING number_ = 0; """)
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   officeCode    city  number_
0          27  Boston        0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [39]:
# Stock of productlines
cur.execute("""

                SELECT l.productLine, SUM(p.quantityInStock) as stock
                FROM productlines AS l
                LEFT JOIN products AS p
                USING (productLine)
                GROUP BY productLine
                
            """)

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

        productLine   stock
0      Classic Cars  219183
1       Motorcycles   69401
2            Planes   62287
3             Ships   26833
4            Trains   16696
5  Trucks and Buses   35851
6      Vintage Cars  124880

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!